import requests

# Це ендпоінт Binance, який віддає поточну ціну Біткоїна


# --- ТВОЯ ЧАСТИНА РОБОТИ ПОЧИНАЄТЬСЯ ТУТ ---

# ЗАВДАННЯ 1: QA Перевірка статусу
# Нормальна відповідь від сервера має статус 200.
# Напиши умову (if/else): якщо response.status_code дорівнює 200, то виведи "✅ Статус 200: З'єднання успішне".
# Інакше - виведи "❌ Помилка з'єднання" і зупини скрипт (можна використати exit())
# ЗАВДАННЯ 2: Розпаковка даних
# Перетвори відповідь сервера у JSON (словник Python).
# Підказка: data = response.json()
# ЗАВДАННЯ 3: Витягування ціни
# Знайди у словнику значення по ключу 'price' і збережи його у змінну price_str.
# ЗАВДАННЯ 4: Конвертація типів (Дуже важливо для QA і Data Science!)
# Біржа віддає ціну як текст (наприклад, "95000.50"). Перетвори price_str на число з плаваючою комою (float).
# Збережи у змінну price_float.
# ЗАВДАННЯ 5: Фінальний автотест (Валідація бізнес-логіки)
# Ціна Біткоїна не може бути нулем або від'ємною.
# Напиши умову: якщо price_float більше за 0, виведи "✅ Тест пройдено: Валідна ціна BTC = [тут твоя ціна]"
# Якщо ні - виведи "❌ Тест провалено: Біржа віддала некоректні дані"



import requests

def check_coin(symbol):
    print(f"\n--- Перевірка монети: {symbol} ---")

    # Підставляємо назву монети прямо в посилання
    url = f"https://api.binance.com/api/v3/ticker/price?symbol={symbol}"

    response = requests.get(url)
    status = response.status_code
    print("Відправляємо запит до біржі...")
    if status == 200:
        print("✅ Сервер дав відповідь")
    elif status == 404:
        print(f"❌ Монету {symbol} не знайдено на біржі")
        return  # <--- Зупиняє функцію, але не вбиває програму!
    else:
        print(f"❌ Невідома помилка: {status}")
        return  # <--- Зупиняє функцію

    data = response.json()
    if 'price' in data:
        price_str = data['price']
    else:
        print('не вдалось знайти ціну')
    price_float = float(price_str)
    if price_float > 0.0:
        print(f"✅ Тест пройдено: Валідна ціна {symbol} = {price_float}")
    else:
        print("❌ Тест провалено: Біржа віддала некоректні дані")

# --- ГОЛОВНА ПРОГРАМА ---
# Тепер ми можемо викликати твою функцію для будь-якої монети одним рядком!

check_coin("BTCUSDT")
check_coin("SOLUSDT")
check_coin("AUDIA3_USDT")  # Спеціально ламаємо, щоб перевірити return
check_coin("ETHUSDT")# Ця має перевіритись успішно, незважаючи на помилку вище
